---
type: LinkLoadContent
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# LinkLoadContent

`Autodesk.Revit.DB.LinkLoadContent` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetLinkDataPath | 2015 | `public ModelPath GetLinkDataPath ()` |
| Method | GetLinkLoadResult | 2015 | `public LinkLoadResult GetLinkLoadResult ()` |
| Method | SetLinkDataPath | 2015 | `public void SetLinkDataPath ( ModelPath linkPath )` |